test subject

In [ ]:
import matplotlib.pyplot as plt
import numpy as np 
data = [50,70,80,59,60,90,95]
grades = np.array(data)
print(grades)

[50 70 80 59 60 90 95]

In [3]:
grades.shape

(7,)

In [4]:
grades[5]

90

In [5]:
grades.mean()

72.0

In [6]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5]

student_data = np.array([study_hours,grades])

In [11]:
student_data[0][0]

10.0

In [12]:
avg_study = student_data[0].mean()
avg_grades = student_data[1].mean()
print(f"average study time : {avg_study}\nAverage Grade: {avg_grades}")

average study time : 9.75
Average Grade: 72.0

In [15]:
import pandas as pd
df_students = pd.DataFrame({'Name': ["Budi","Dina","Caca","Ambatukam","rusdi","fuad","si imut"], 'StudyHours' : student_data[0] , 'Grade' : student_data[1]})

df_students

        Name  StudyHours  Grade
0       Budi       10.00   50.0
1       Dina       11.50   70.0
2       Caca        9.00   80.0
3  Ambatukam       16.00   59.0
4      rusdi        9.25   60.0
5       fuad        1.00   90.0
6    si imut       11.50   95.0

In [16]:
df_students.loc[5]

Name          fuad
StudyHours     1.0
Grade         90.0
Name: 5, dtype: object

In [ ]:
df_students.loc[5,"Name"]

df_students.loc[df_students["Name"] == "fuad"]
df_students.loc[df_students.Name=="fuad"]
# 3 cara mengunakkan loc

   Name  StudyHours  Grade
5  fuad         1.0   90.0

In [22]:
df_students = pd.read_csv("grades.csv" , delimiter=","  , header="infer")

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0
22       Bill        8.00    NaN
23        Ted         NaN    NaN

In [27]:
df_students.isnull().sum()

Name          0
StudyHours    0
Grade         0
dtype: int64

In [25]:
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())

In [26]:
df_students = df_students.dropna(axis=0)

In [28]:
mean_study = df_students["StudyHours"].mean()

mean_grade = df_students.Grade.mean()

print(f"Average weekly study hours: {mean_study}\nAverage grade: {mean_grade}")

Average weekly study hours: 10.522727272727273
Average grade: 49.18181818181818

In [ ]:
df_students[df_students.StudyHours > mean_study].Grade.mean()

66.7

In [31]:
passed = pd.Series(df_students.Grade >= 60)
df_students =pd.concat([df_students,passed.rename("Passed")] , axis=1)

In [32]:
df_students.groupby(df_students.Passed).Name.count()

Passed
False    15
True      7
Name: Name, dtype: int64

In [37]:
print(df_students.groupby(df_students.Passed).Grade.mean())

Passed
False    38.000000
True     73.142857
Name: Grade, dtype: float64

In [41]:
df_students = df_students.sort_values(["StudyHours"] , ascending=False)

In [ ]:
fig, ax = plt.subplots(1,2,figsize=(10,4))

ax[0].bar (x=df_students.Name , height=df_students.Grade , color='orange')

ax[0].set_title("student grades")
ax[0].set_xticklabels(df_students.Name , rotation=90)

passes_count = df_students.Pass.value_counts()
ax[1].pie(passes_count , labels=passes_count)
ax[1].set_title("student passes")

fig.show()